In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [13]:
# create a data frame
df = pd.DataFrame([[1, 9, 2, 6.6],
                  [2, 5, np.nan, 8],
                  [1, np.nan, None, 7.8]],
                 columns=['A','B','C','D'])

In [ ]:
# isna ir is null to check the total null or NaN values in the data set
df.isna()
df.isnull()
df.isna().sum()
df.isnull().sum()

In [ ]:
df.dropna(axis = 0)  # axis 1 indicate the rows
df.dropna(axis = 1)  # axis 0 indicate the columns

df.dropna(axis = 1, inplace= True)
df

In [ ]:
df.fillna('d')

#### forward fill and backward fill using methods

In [ ]:
df.ffill()  # forward fill
df.bfill()  # backward fil

In [16]:
df.replace(to_replace=5,value=0, regex=False)

   A    B    C    D
0  1  9.0  2.0  6.6
1  2  0.0  NaN  8.0
2  1  NaN  NaN  7.8

### Thresh in drop na

In [17]:
df = pd.DataFrame({
    'A': [1, 2, np.nan, 4],
    'B': [np.nan, 2, 3, np.nan],
    'C': [1, np.nan, np.nan, 4],
    'D': [np.nan, np.nan, np.nan, 4]
})

In [18]:
df.dropna(thresh=2) # # Drop rows with less than 2 non-NA values

     A    B    C    D
0  1.0  NaN  1.0  NaN
1  2.0  2.0  NaN  NaN
3  4.0  NaN  4.0  4.0

In [19]:
df.dropna(axis=1, thresh=3) # Drop columns with less than 3 non-NA values

     A
0  1.0
1  2.0
2  NaN
3  4.0

### Regex in Replace

In [20]:
df = pd.DataFrame({
    'A': ['foo123', 'bar456', 'baz789'],
    'B': ['123abc', '456def', '789ghi']
})

A = df.replace({'A':r'\d'}, 'x', regex=False)
B = df.replace({'B':r'\d'}, 'x', regex=False)

A1 = df.replace({'A':r'\d'}, 'x', regex=True)
B1 = df.replace({'B':r'\d'}, 'x', regex=True)

print(A)
print(B)
print(A1)
print(B1)

        A       B
0  foo123  123abc
1  bar456  456def
2  baz789  789ghi
        A       B
0  foo123  123abc
1  bar456  456def
2  baz789  789ghi
        A       B
0  fooxxx  123abc
1  barxxx  456def
2  bazxxx  789ghi
        A       B
0  foo123  xxxabc
1  bar456  xxxdef
2  baz789  xxxghi